In [1]:
import numpy as np
import pandas as pd

In [2]:
order = pd.read_csv("/Users/TakayukiYagi/Developer/M1/competition/data/order.csv")
detail = pd.read_csv("/Users/TakayukiYagi/Developer/M1/competition/data/order_detail.csv")
item = pd.read_csv("/Users/TakayukiYagi/Developer/M1/competition/data/item.csv")

In [3]:
order.head(5)

,customer_id,order_id,reservation_flag,device,order_date,additional_fee
0,5537,79349,0,2,2015-06-07 12:29,0
1,16937,253453,0,1,2015-10-04 17:37,0
2,22657,34084,0,1,2015-04-29 12:09,0
3,24217,180215,0,1,2015-08-08 10:15,1000
4,68938,148043,0,2,2015-07-17 11:55,0

In [4]:
detail.head(5)

,order_id,order_detail_id,item_id,item_detail_id,sale_item_flag,order_amount,quantity
0,250201,1,200824,1,0,11000,1
1,388563,1,330021,1,0,2000,1
2,73679,1,81856,3,1,3000,1
3,582406,2,427342,1,0,2000,1
4,361403,1,32182,1,1,3000,1

In [5]:
item.head(5)

,item_id,item_detail_id,color,color_category,size,item_category_1,item_category_2,shop_id,brand_id
0,1092,1,ブラック,ブラック系,ONE SIZE,バッグ,トートバッグ,279,5309
1,7784,1,その他1,その他,ONE SIZE,財布/小物,ポーチ,24,87
2,8008,2,その他11,その他,FREE,アクセサリー,ピアス（両耳用）,279,5309
3,8008,1,その他2,その他,FREE,アクセサリー,ピアス（両耳用）,279,5309
4,9250,3,ネイビー,ブルー系,MEDIUM,トップス,Tシャツ/カットソー,443,5791

In [6]:
df = pd.merge(pd.merge(order, detail, on='order_id', how='left'), item, on=['item_id', 'item_detail_id'], how='left')[['order_date' ,'customer_id', 'item_category_2']].dropna()

In [8]:
df.head(5)

         order_date  customer_id item_category_2
0  2015-06-07 12:29         5537       ステッカー/テープ
1  2015-06-07 12:29         5537       ステッカー/テープ
2  2015-06-07 12:29         5537       ステッカー/テープ
3  2015-06-07 12:29         5537       ステッカー/テープ
4  2015-10-04 17:37        16937      Tシャツ/カットソー

In [21]:
def str2date(tstr):
    import datetime
    tdatetime = datetime.datetime.strptime(tstr, '%Y-%m-%d %H:%M')
    tdate = datetime.date(tdatetime.year, tdatetime.month, tdatetime.day)
    return tdate

In [25]:
df.order_date = df.order_date.apply(str2date)

In [35]:
min_date = df.order_date.min()
max_date = df.order_date.max()

datetime.date(2016, 3, 31)